ROR Course/app/controllers/entries_controller.rb

  def index
    @entries = Entry.where("created_at >= ?",Date.today)
---
SELECT "entries".* FROM "entries" WHERE (created_at >= '2021-07-14')

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("meal_type", "calories", "protiens", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "Breakfast"], ["calories", 600], ["protiens", 23], ["carbohydrates", 50], ["fats", 10], ["created_at", "2021-07-14 08:56:16.474374"], ["updated_at", "2021-07-14 08:56:16.474374"]]