ROR Course/app/views/entries/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id, class: "label" %>
    <%= form.select :category_id,  Category.all.collect {|u| [u.title, u.id]}, {}, class: "select" %>